[{"UID":"pimco","chat":false,"name":"PIMCO","url":"https://www.pimco.com/"},{"UID":"sap","attachments":[{"name":"HanaHaus Newport Beach","url":"https://www.hanahaus.com/newportbeach"},{"name":"SAP Innovation Center Newport Beach","url":"https://sap-icn.netlify.app/location/newport-beach"},{"name":"SAP","url":"https://www.sap.com/index.html"}],"chat":false,"contactInfo":"Email us at <a href=\"Innovation_Center@sap.com\">Innovation_Center@sap.com</a>","description":"<p>The SAP Innovation Center Network (ICN) is a global organization of applied research and development teams across locations in China (Nanjing), France (Mougins), Germany (Karlsruhe, Munich, Potsdam, Walldorf), India (Bangalore) and the United States (Newport Beach, CA; Palo Alto, CA). Our mission is to future-proof SAP, one of the world’s largest provider of enterprise software, by contextualizing emerging technologies through hands-on experimentation and evaluation.</p> <p>At ICN we foster strong teams and develop solutions jointly with customers and partners from business, academia, and the start-up industry, applying Design Thinking and other novel approaches. We pioneer new markets and disruptive technologies with the goal to develop game-changing solutions. In 2019, ICN established a new location in Southern California, and is actively looking for machine learning scientists to expand our team.</p>","name":"SAP","sessionIds":["d1hallway","d2hallway","d3hallway"],"url":"https://icn.sap.com/"},{"UID":"microsoft","attachments":[{"name":"Student Internships","url":"/static/sponsors/msr-internships.pdf"},{"name":"Academic Fellowship Program","url":"/static/sponsors/msr-fellowship.pdf"},{"name":"Resources","url":"/static/sponsors/msr-resources.pdf"}],"chat":false,"description":"Microsoft Research is where leading scientists and engineers have the freedom and support to propel discovery and innovation. Here, they pursue and publish curiosity-driven research in a range of scientific and technical disciplines that can be translated into products. With access to vast computing power, global multi-disciplinary teams tackle complex problems that drive breakthrough technologies and improve lives.","embedPDF":"msr-intro.pdf","name":"Microsoft","url":"https://www.microsoft.com/en-us/research/"},{"UID":"ibm","chat":false,"name":"IBM","sessionIds":["d1hallway","d2hallway","d3hallway"],"url":"https://www.ibm.com/"},{"UID":"google","chat":false,"name":"Google","sessionIds":["d1hallway","d2hallway","d3hallway"],"url":"https://www.google.com/"},{"UID":"relational_ai","chat":false,"contactInfo":"Email us at <a href=\"info@relational.ai\">info@relational.ai</a>","description":"<p>At RelationalAI, we believe that future enterprise systems will be built with knowledge graphs as a foundation and that each component of the system will either be learned (via machine learning) or declared (via a reasoner). The days of instructing the computer, step-by-step, on how to perform a task will be behind us.</p> <p>We have brought together a group of leading researchers, data scientists, computer scientists and software engineers with extensive experience applying novel technologies to a wide range of complex problems to meet this challenge.</p>","name":"Relational.AI","sessionIds":["d1hallway","d2hallway","d3hallway"],"url":"https://www.relational.ai/"},{"UID":"oracle","chat":false,"contactInfo":"You can contact <a href=\"mailto:stephen.x.green@oracle.com\">Stephen Green</a> for more information about the Machine Learning Research Group.","description":"<p>The mission of the Machine Learning Research Group (MLRG) is to scale Machine Learning (ML) across Oracle. We do this by: </p> <ul> <li>Undertaking fundamental ML research. MLRG members' research interests cover a wide range of ML work including fairness, privacy, and Natural Language Processing</li> <li>Collaborating with product groups and business units world-wide in order to develop ML-based solutions that will improve their products and services.</li> <li>Building proof-of-concept systems that demonstrate the viability of an ML approach to solving particular business problems. The MLRG will transfer both the code and the ML methodology to the product group.</li> <li>Helping product groups understand how to operationalize Machine Learning solutions in order to get the maximum benefit from them.</li> <li>Acquiring and building Machine Learning tools.</li> <li>Building an ML community at Oracle. The MLRG hosts an internal ML summit each year that brings together ML practitioners from across Oracle.</li> <li>Managing data acquisition and storage for ML work.</li> </ul>","embedPDF":"oracle-MLRG-AKBC.pdf","name":"Oracle Labs","url":"https://labs.oracle.com"}]
