[{"UID":"kbmm","abstract":"<p>Recently, there has been growing interest in combining knowledge bases and multiple modalities such as NLP, vision and speech. These combinations have resulted in improvements to various downstream tasks including question answering, image classification, object detection, and link prediction. The objectives of the KBMM workshop is to bring together researchers interested in (a) combining knowledge bases with other modalities to showcase more effective downstream tasks, (b) improving completion and construction of knowledge bases from multiple modalities, and in general, to share state-of-the-art approaches, best practices, and future directions.</p>","acronym":"KBMM","authors":["Pouya Pezeshkpour","Anand Mishra","Alice Wang","Hugues Bouchard","Aasish Pappu","Partha Talukdar","Sameer Singh"],"duration":"Half-day","schedule":[{"time":"0:00-","title":"<i>Opening Remarks</i>"},{"time":"3:00-","title":"Invited speaker: <b>Axel Ngonga</b> on Structured Machine Learning for Industrial Machinery"},{"time":"52:00-","title":"Invited speaker: <b>Chenyan Xiong</b> on Representation Learning and Reasoning with Semi-structured Free-Text Knowledge Graph"},{"time":"1:35:35-","title":"<i>Break</i>"},{"time":"1:50:50-","title":"Student presentation: <b>Kenneth Marino</b> on Visual Question Answering Benchmark Requiring External Knowledge"},{"time":"2:06:33-","title":"Invited speaker: <b>Mathias Niepert</b> on Towards Multimodal and Explainable Knowledge Graphs"},{"time":"2:52:50-","title":"<i>Break</i>"},{"time":"3:04:12-","title":"Student presentation: <b>Nitisha Jain</b> on Multimodal Knowledge Graphs for Semantic Analysis of Cultural Heritage Data"},{"time":"3:21:15-","title":"Invited speaker: <b>Mike Tung</b> on The Diffbot Knowledge Graph"},{"time":"4:06:22-","title":"<i>Closing remarks</i>"}],"slido":"nkdw70hk","title":"Knowledge Bases and Multiple Modalities","url":"https://kb-mm-2020.github.io","youtube":"EcOfP1aYQpI","zoomId":71764919889},{"UID":"uskb","abstract":"<p>Knowledge bases have been a key part of AI research and applications for decades. Traditionally, KBs were purely symbolic but more recently deep learning advances have raised the possibility of having purely unstructured/implicit neural KBs.</p> <p>The objectives of this workshop is to bring together researchers exploring different paradigms of extracting, representing and applying knowledge. We will discuss knowledge spanning across <b>Structured</b> (tables, graphs, etc) to <b>Unstructured</b> (plain text), and <b>Explicit</b> (symbolic) to <b>Implicit</b> (parameterized).</p>","authors":["Danqi Chen","Rajarshi Das","Angela Fan","Sewon Min","Siva Reddy","Pat Verga"],"duration":"Half-day","schedule":[{"time":"0:00:00-","title":"Kenneth Forbus, Northwestern University"},{"time":"0:30:16-","title":"Philipp Cimiano, Bielefeld University"},{"time":"0:58:40-","title":"Will Hamilton, McGill University / Mila"},{"time":"1:30:39-","title":"Yunyao Li, IBM Research"},{"time":"2:01:21-","title":"Fabio Petroni, Facebook AI Research"},{"time":"2:32:43-","title":"Colin Raffel, University of North Carolina"},{"time":"3:08:54-","title":"Panel discussion"}],"slido":"3aiwhw9w","title":"Structured and Unstructured KBs","url":"https://uskb-workshop.github.io/","youtube":"V4nbWiPdnTE","zoomId":73307451410},{"UID":"scinlp","abstract":"<p>The primary goal of this half-day workshop is to bring together researchers from diverse fields who are interested in extracting and representing knowledge from scientific text, and/or applications or methods for improving access to and understanding of such knowledge. Please see <a href=\"https://scinlp.org\">https://scinlp.org</a> for schedule, accepted posters, and other details.</p>","acronym":"SciNLP","additionalZooms":[{"name":"Poster Session 1","zoomId":89795024676},{"name":"Poster Session 2","zoomId":81745212184},{"name":"Poster Session 3","zoomId":84238172349}],"authors":["Kyle Lo","Iz Beltagy","Arman Cohan","Keith Hall","Yi Luan","Lucy Lu Wang"],"duration":"Half-day","title":"Natural Language Processing and Data Mining for Scientific Text","url":"https://scinlp-workshop.github.io/","youtube":"videoseries?list=PLOTELVgUs9jKW2EkJbAyi6DcunfaXf0r6","zoomId":7456318332},{"UID":"kgbias","abstract":"<p>Knowledge Graphs (KGs) store human knowledge about the world in structured format, e.g., triples of facts or graphs of entities and relations, to be processed by AI systems. In the past decade, extensive research efforts have gone into constructing and utilizing knowledge graphs for tasks in natural language processing, information retrieval, recommender systems, and more. Once constructed, knowledge graphs are often considered as “gold standard” data sources that safeguard the correctness of other systems. Because the biases inherent to KGs may become magnified and spread through such systems, it is crucial that we acknowledge and address various types of bias in knowledge graph construction.</p> <p>Such biases may originate in the very design of the KG, in the source data from which it is created (semi-)automatically, and in the algorithms used to sample, aggregate, and process that data. Causes of bias include systematic errors due to selecting non-random items (selection bias), misremembering certain events (recall bias), and interpreting facts in a way that affirms individuals’ preconceptions (confirmation bias). Biases typically appear subliminally in expressions, utterances, and text in general and can carry over into downstream representations such as embeddings and knowledge graphs.</p> <p>This workshop – to be held for the first time at AKBC 2020 – addresses the questions: “how do such biases originate?”, “How do we identify them?”, and “What is the appropriate way to handle them, if at all?”. This topic is as-yet unexplored and the goal of our workshop is to start a meaningful, long-lasting dialogue spanning researchers across a wide variety of backgrounds and communities.</p>","acronym":"KG-BIAS","authors":["Edgar Meij","Tara Safavi","Chenyan Xiong","Miriam Redi","Gianluca Demartini","Fatma Özcan"],"duration":"Half-day","schedule":[{"time":"8:00-8:15","title":"Welcome and Opening Remarks"},{"time":"8:15-9:00","title":"<b>Keynote:</b> Jahna Otterbacher, Open University of Cyprus. Bias in Data and Algorithmic Systems: A \"Fish-Eye View\" of Problems, Solutions and Stakeholders."},{"time":"9:00-9:30","title":"<b>Invited paper</b> Joseph Fisher, Dave Palfrey, Arpit Mittal and Christos Christodoulopoulos. Measuring social bias in knowledge graph embeddings."},{"time":"9:30-9:45","title":"Break"},{"time":"9:45-10:05","title":"Christine Wolf. From Knowledge Graphs to Knowledge Practices: On the Need for Transparency and Explainability in Enterprise Knowledge Graph Applications."},{"time":"10:05-10:25","title":"Shubhanshu Mishra, Sijun He and Luca Belli. Assessing Demographic Bias in Named Entity Recognition."},{"time":"10:25-10:45","title":"Emma Gerritse, Faegheh Hasibi and Arjen P. de Vries. Bias in Conversational Search: The Double-Edged Sword of the Personalized Knowledge Graph."},{"time":"10:45-11:00","title":"Break"},{"time":"11:00-11:45","title":"<b>Keynote:</b> Jieyu Zhao. Detecting and mitigating gender bias in NLP."},{"time":"11:45-12:00","title":"Break"},{"time":"12:00-13:00","title":"Plenary Discussion, Wrap-up and Concluding Remarks"}],"title":"Bias in Automatic Knowledge Graph Construction","url":"https://kg-bias.github.io/","youtube":"JY6nNZzeq7I","zoomId":87147230242}]
